app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("name", "string", "description", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["string", "test"], ["description", "test"], ["text", "test"], ["created_at", "2017-07-22 01:42:14.411924"], ["updated_at", "2017-07-22 01:42:14.411924"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save